
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/yuta051214/aws-ecs-terraform/actions/runs/5128894666)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06656c5c3602f0f5d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f745594c0f320817]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-029491a8a902647c7]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0054216335c294644]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083a026f63d526c5d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0732e30fca26370d6]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-087a561778d6e5a55]
aws_security_group.alb: Refreshing state... [id=sg-05c7fc4678898ca54]
aws_security_group.ecs: Refreshing state... [id=sg-01ac9694e73ce7907]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:targetgroup/go-simple-server-target-group/29ad26420bbc504c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0fe40e4127bd7e683]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08601bb7dbcd97701]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-045aeb3b5dc72c33c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-05bf2ce5441b4724d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0667f822c116447c0]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-029491a8a902647c71080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb7fc86204155dce]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0a9f7eb7fcf5eb315]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1805189038]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d73844da0ac85ea8]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-060e5a31b77fe85c1]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:loadbalancer/app/go-simple-server-alb/aede6b28620276fb]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-020fb839e900f77d5]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a60610289f274ed7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-06a6592ae719519e0]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f1336eac8f68336b]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f745594c0f3208171080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0fe40e4127bd7e6831080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:listener/app/go-simple-server-alb/aede6b28620276fb/2167cfbbd8a69453]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:847208500766:listener-rule/app/go-simple-server-alb/aede6b28620276fb/2167cfbbd8a69453/a9993953bdf6aa70]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"3db7634eb97a9f71800b001ebc1b768263fa124e","Vars":{},"WorkflowName":"Terraform"} -->